# Penguin Data
---
**Author:** Robert Kelley  
**Version:** 2.1  
**Semester:** Spring 2022  
**Summary:**  

I developed this notebook to so we could walk through the various functions from Pandas for getting descriptive statistics on a dataset.  The dataset for this notebook was obtained from: https://github.com/allisonhorst/palmerpenguins.

In [81]:
import pandas as pd
import numpy as np
#import matplotlib.pyplot as plt
#import seaborn as sns
#%matplotlib inline

import scipy.stats as stats

## Read the dataset / Quick look at data

In [82]:
df = pd.read_csv('penguins_size.csv')

In [83]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [84]:
df[['species','sex']]

    species     sex
0    Adelie    MALE
1    Adelie  FEMALE
2    Adelie  FEMALE
3    Adelie     NaN
4    Adelie  FEMALE
..      ...     ...
339  Gentoo     NaN
340  Gentoo  FEMALE
341  Gentoo    MALE
342  Gentoo  FEMALE
343  Gentoo    MALE

[344 rows x 2 columns]

In [85]:
df.iloc[0:3,1:3]

      island  culmen_length_mm
0  Torgersen              39.1
1  Torgersen              39.5
2  Torgersen              40.3

In [86]:
male = df[df['sex']=='MALE']

In [87]:
female = df[df['sex']=='FEMALE']

In [88]:
len(df)

344

In [89]:
len(male)+len(female)

333

In [90]:
df.describe()

       culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
count        342.000000       342.000000         342.000000   342.000000
mean          43.921930        17.151170         200.915205  4201.754386
std            5.459584         1.974793          14.061714   801.954536
min           32.100000        13.100000         172.000000  2700.000000
25%           39.225000        15.600000         190.000000  3550.000000
50%           44.450000        17.300000         197.000000  4050.000000
75%           48.500000        18.700000         213.000000  4750.000000
max           59.600000        21.500000         231.000000  6300.000000

In [91]:
male.describe()

       culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
count        168.000000       168.000000         168.000000   168.000000
mean          45.854762        17.891071         204.505952  4545.684524
std            5.366896         1.863351          14.547876   787.628884
min           34.600000        14.100000         178.000000  3250.000000
25%           40.975000        16.075000         193.000000  3900.000000
50%           46.800000        18.450000         200.500000  4300.000000
75%           50.325000        19.250000         219.000000  5312.500000
max           59.600000        21.500000         231.000000  6300.000000

In [92]:
female.describe()

       culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
count        165.000000       165.000000         165.000000   165.000000
mean          42.096970        16.425455         197.363636  3862.272727
std            4.903476         1.795681          12.500776   666.172050
min           32.100000        13.100000         172.000000  2700.000000
25%           37.600000        14.500000         187.000000  3350.000000
50%           42.800000        17.000000         193.000000  3650.000000
75%           46.200000        17.800000         210.000000  4550.000000
max           58.000000        20.700000         222.000000  5200.000000

## Measures of Centrality
How the data is clustered.

In [93]:
female[['culmen_length_mm','flipper_length_mm']].median()

culmen_length_mm      42.8
flipper_length_mm    193.0
dtype: float64

In [94]:
female.median(numeric_only=True)

culmen_length_mm       42.8
culmen_depth_mm        17.0
flipper_length_mm     193.0
body_mass_g          3650.0
dtype: float64

In [95]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [96]:
df.mode()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Biscoe,41.1,17.0,190.0,3800.0,MALE

### Arithmetic Mean

In [97]:
df.mean(numeric_only=True)

culmen_length_mm       43.921930
culmen_depth_mm        17.151170
flipper_length_mm     200.915205
body_mass_g          4201.754386
dtype: float64

In [98]:
female['culmen_length_mm'].mean()

42.09696969696968

### Geometric Mean

In [99]:
values = [3.5, 75, 653, 12]
mymean =sum(values)/len(values)
print(mymean)
print(stats.gmean(values))

185.875
37.87092681749659

### Harmonic Mean

In [100]:
rates = [15000, 16000, 28000, 21000, 30000]
mymean =sum(rates)/len(rates)
print(mymean)
print(stats.hmean(rates))

22000.0
20338.98305084746

## Measures of Dispersion
How spread out our data are.

### Range

In [101]:
df['culmen_length_mm'].max()-df['culmen_length_mm'].min()

27.5

### Interquartile Range

In [102]:
df.culmen_length_mm.quantile(.75)-df.culmen_length_mm.quantile(.25)

9.274999999999999

### Variance

In [103]:
df.culmen_length_mm.var()

29.80705432937183

### Standard Deviation

In [104]:
df.culmen_length_mm.std()

5.459583713926532

## Correlation

In [105]:
df.corr()

,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g
culmen_length_mm,1.000000,-0.235053,0.656181,0.595110
culmen_depth_mm,-0.235053,1.000000,-0.583851,-0.471916
flipper_length_mm,0.656181,-0.583851,1.000000,0.871202
body_mass_g,0.595110,-0.471916,0.871202,1.000000

## Using Pandas

In [106]:
p = pd.read_csv('penguins_lter.csv')

We can look the data with .sample(), .head() or .tail()

In [107]:
p.tail()

,studyName,Sample Number,Species,Region,Island,Stage,Individual ID,Clutch Completion,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex,Delta 15 N (o/oo),Delta 13 C (o/oo),Comments
339,PAL0910,120,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N38A2,No,12/1/09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
340,PAL0910,121,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N39A1,Yes,11/22/09,46.8,14.3,215.0,4850.0,FEMALE,8.41151,-26.13832,NaN
341,PAL0910,122,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N39A2,Yes,11/22/09,50.4,15.7,222.0,5750.0,MALE,8.30166,-26.04117,NaN
342,PAL0910,123,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N43A1,Yes,11/22/09,45.2,14.8,212.0,5200.0,FEMALE,8.24246,-26.11969,NaN
343,PAL0910,124,Gentoo penguin (Pygoscelis papua),Anvers,Biscoe,"Adult, 1 Egg Stage",N43A2,Yes,11/22/09,49.9,16.1,213.0,5400.0,MALE,8.36390,-26.15531,NaN

View the column names

In [108]:
p.columns

Index(['studyName', 'Sample Number', 'Species', 'Region', 'Island', 'Stage',
       'Individual ID', 'Clutch Completion', 'Date Egg', 'Culmen Length (mm)',
       'Culmen Depth (mm)', 'Flipper Length (mm)', 'Body Mass (g)', 'Sex',
       'Delta 15 N (o/oo)', 'Delta 13 C (o/oo)', 'Comments'],
      dtype='object')

Group by various columns in the dataset to determine how many different values are in the categorical variables.

In [112]:
p['Species'].groupby(p['Species']).count()

Species
Adelie Penguin (Pygoscelis adeliae)          152
Chinstrap penguin (Pygoscelis antarctica)     68
Gentoo penguin (Pygoscelis papua)            124
Name: Species, dtype: int64

Drop columns we don't need.

In [113]:
p.drop(['Sample Number', 'Region','Stage', 'Individual ID', 'Comments'], 
       axis=1, inplace=True)

In [114]:
p.columns

Index(['studyName', 'Species', 'Island', 'Clutch Completion', 'Date Egg',
       'Culmen Length (mm)', 'Culmen Depth (mm)', 'Flipper Length (mm)',
       'Body Mass (g)', 'Sex', 'Delta 15 N (o/oo)', 'Delta 13 C (o/oo)'],
      dtype='object')

Rename the columns to names that are easier to work with.

In [115]:
col_names = ['study_name',
             'species',
             'island',
             'clutch_completion',
             'date_egg',
             'bill_length',
             'bill_depth',
             'flipper_length',
             'body_mass',
             'sex',
             'delta_15',
             'delta_13'
            ]

In [116]:
p.columns = col_names

p.columns

In [117]:
p.columns

Index(['study_name', 'species', 'island', 'clutch_completion', 'date_egg',
       'bill_length', 'bill_depth', 'flipper_length', 'body_mass', 'sex',
       'delta_15', 'delta_13'],
      dtype='object')

In [118]:
p.groupby(p.species).count()

,study_name,island,clutch_completion,date_egg,bill_length,bill_depth,flipper_length,body_mass,sex,delta_15,delta_13
species,,,,,,,,,,,
Adelie Penguin (Pygoscelis adeliae),152,152,152,152,151,151,151,151,146,141,141
Chinstrap penguin (Pygoscelis antarctica),68,68,68,68,68,68,68,68,68,67,68
Gentoo penguin (Pygoscelis papua),124,124,124,124,123,123,123,123,120,122,122

Here was my original code.  Turns out, I didn't need to specify the last three columns because they are automatically ignored.

In [119]:
p[['species','t1','t2','t3']] = p.species.str.split(expand=True)
p.drop(['t1','t2','t3'],axis=1, inplace=True)

In [120]:
#p['species']=p.species.str.split(expand=True)

In [121]:
p.columns

Index(['study_name', 'species', 'island', 'clutch_completion', 'date_egg',
       'bill_length', 'bill_depth', 'flipper_length', 'body_mass', 'sex',
       'delta_15', 'delta_13'],
      dtype='object')

In [122]:
p.species

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [123]:
p.head()

,study_name,species,island,clutch_completion,date_egg,bill_length,bill_depth,flipper_length,body_mass,sex,delta_15,delta_13
0,PAL0708,Adelie,Torgersen,Yes,11/11/07,39.1,18.7,181.0,3750.0,MALE,NaN,NaN
1,PAL0708,Adelie,Torgersen,Yes,11/11/07,39.5,17.4,186.0,3800.0,FEMALE,8.94956,-24.69454
2,PAL0708,Adelie,Torgersen,Yes,11/16/07,40.3,18.0,195.0,3250.0,FEMALE,8.36821,-25.33302
3,PAL0708,Adelie,Torgersen,Yes,11/16/07,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,PAL0708,Adelie,Torgersen,Yes,11/16/07,36.7,19.3,193.0,3450.0,FEMALE,8.76651,-25.32426

I didn't mean to drop the measurements on the columns. Here we are renaming just specific columns in the data set.

In [57]:
p.rename(columns={
    'bill_length':'bill_length_mm',
    'bill_depth': 'bill_depth_mm',
    'flipper_length': 'flipper_length_mm',
    'body_mass': 'body_mass_g'
}, inplace=True)

Let's look at the data types.

In [124]:
p.dtypes

study_name            object
species               object
island                object
clutch_completion     object
date_egg              object
bill_length          float64
bill_depth           float64
flipper_length       float64
body_mass            float64
sex                   object
delta_15             float64
delta_13             float64
dtype: object

We have several strings, and float64. date_egg should be a date.

In [125]:
p.date_egg = pd.to_datetime(p.date_egg)

In [126]:
p.dtypes

study_name                   object
species                      object
island                       object
clutch_completion            object
date_egg             datetime64[ns]
bill_length                 float64
bill_depth                  float64
flipper_length              float64
body_mass                   float64
sex                          object
delta_15                    float64
delta_13                    float64
dtype: object

I want to add a new column for day of the study the penguin was observed. We first subtract date_egg from the earliest date in the column, convert to string, strip off the 'days' word from the end and convert to an int.

In [132]:
p['study_day']=p.date_egg-p.date_egg.min()
p['study_day']=p['study_day'].astype(str)
p['study_day']=p['study_day'].str[:-4]
p['study_day']=p['study_day'].astype(int)

In [130]:
p['study_day']=p['study_day'].str[:-4]

In [133]:
p.study_day

0        2
1        2
2        7
3        7
4        7
      ...
339    753
340    744
341    744
342    744
343    744
Name: study_day, Length: 344, dtype: int64

In [62]:
p.study_day

0        2
1        2
2        7
3        7
4        7
      ...
339    753
340    744
341    744
342    744
343    744
Name: study_day, Length: 344, dtype: int64

We can do most of manipulations with chaining (except the last one).

In [134]:
#p['study_day']=p.date_egg-p.date_egg.min().astype(str).str[:-4]
#p['study_day']=p['study_day'].astype(int)

In [140]:
len(p)

330

Let's get rid of all the rows that have missing data in certain columns.

In [137]:
p = p[p.bill_length.notna()]

In [139]:
p = p[p.delta_15.notna()]

In [143]:
p['sex'].groupby(p.sex).count()

sex
FEMALE    163
MALE      161
Name: sex, dtype: int64

Looks like we have an errant value in 'sex'. We need to remove it. **This is the code I couldn't remember to get the index of dataframe row and then drop it**

In [142]:
i = p[p.sex=='.'].index
p.drop(i, inplace=True)

.info() gives us some summary meta data.  I noticed that we are missing the sex for 5 penguins.

In [144]:
p.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 329 entries, 1 to 343
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   study_name         329 non-null    object
 1   species            329 non-null    object
 2   island             329 non-null    object
 3   clutch_completion  329 non-null    object
 4   date_egg           329 non-null    datetime64[ns]
 5   bill_length        329 non-null    float64
 6   bill_depth         329 non-null    float64
 7   flipper_length     329 non-null    float64
 8   body_mass          329 non-null    float64
 9   sex                324 non-null    object
 10  delta_15           329 non-null    float64
 11  delta_13           329 non-null    float64
 12  study_day          329 non-null    int64
dtypes: datetime64[ns](1), float64(6), int64(1), object(5)
memory usage: 44.1+ KB

In [145]:
p.sex.groupby(p.sex.isna()).count()

sex
False    324
True       0
Name: sex, dtype: int64

Let's get the index for the rows were penguin was empty and investigate.

In [146]:
i = p[p.sex.isna()].index
print(i)
p[p.index==9]

Int64Index([9, 10, 246, 286, 324], dtype='int64')

,study_name,species,island,clutch_completion,date_egg,bill_length,bill_depth,flipper_length,body_mass,sex,delta_15,delta_13,study_day
9,PAL0708,Adelie,Torgersen,Yes,2007-11-09,42.0,20.2,190.0,4250.0,NaN,9.13362,-25.09368,0

NaN (not a number) means its empty.  Let's just drop these too.

In [147]:
p.drop(i, inplace=True)
p.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 324 entries, 1 to 343
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   study_name         324 non-null    object
 1   species            324 non-null    object
 2   island             324 non-null    object
 3   clutch_completion  324 non-null    object
 4   date_egg           324 non-null    datetime64[ns]
 5   bill_length        324 non-null    float64
 6   bill_depth         324 non-null    float64
 7   flipper_length     324 non-null    float64
 8   body_mass          324 non-null    float64
 9   sex                324 non-null    object
 10  delta_15           324 non-null    float64
 11  delta_13           324 non-null    float64
 12  study_day          324 non-null    int64
dtypes: datetime64[ns](1), float64(6), int64(1), object(5)
memory usage: 35.4+ KB

Looks good. Now we can save.

In [148]:
p.to_csv('processed_penguins.csv', index=False)

In [149]:
p.head()

,study_name,species,island,clutch_completion,date_egg,bill_length,bill_depth,flipper_length,body_mass,sex,delta_15,delta_13,study_day
1,PAL0708,Adelie,Torgersen,Yes,2007-11-11,39.5,17.4,186.0,3800.0,FEMALE,8.94956,-24.69454,2
2,PAL0708,Adelie,Torgersen,Yes,2007-11-16,40.3,18.0,195.0,3250.0,FEMALE,8.36821,-25.33302,7
4,PAL0708,Adelie,Torgersen,Yes,2007-11-16,36.7,19.3,193.0,3450.0,FEMALE,8.76651,-25.32426,7
5,PAL0708,Adelie,Torgersen,Yes,2007-11-16,39.3,20.6,190.0,3650.0,MALE,8.66496,-25.29805,7
6,PAL0708,Adelie,Torgersen,No,2007-11-15,38.9,17.8,181.0,3625.0,FEMALE,9.18718,-25.21799,6

Let's split out a separate data set for adelie penguins to save.  First, we subset the data by 'Adelie', drop the 'species' column, and then save to file.

In [75]:
adelie = p[p['species']=='Adelie']
adelie.drop(['species'], axis=1,inplace=True)
adelie.to_csv('adelie.csv', index=False)

/home/rrkelley/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [76]:
adelie.head()

,study_name,island,clutch_completion,date_egg,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,delta_15,delta_13,study_day
1,PAL0708,Torgersen,Yes,2007-11-11,39.5,17.4,186.0,3800.0,FEMALE,8.94956,-24.69454,2
2,PAL0708,Torgersen,Yes,2007-11-16,40.3,18.0,195.0,3250.0,FEMALE,8.36821,-25.33302,7
4,PAL0708,Torgersen,Yes,2007-11-16,36.7,19.3,193.0,3450.0,FEMALE,8.76651,-25.32426,7
5,PAL0708,Torgersen,Yes,2007-11-16,39.3,20.6,190.0,3650.0,MALE,8.66496,-25.29805,7
6,PAL0708,Torgersen,No,2007-11-15,38.9,17.8,181.0,3625.0,FEMALE,9.18718,-25.21799,6

I would like to be able to save data sets for each species. This code gets the types with a groupby then it loops through the index (which contains the species) and subsets the data, drops the 'species' column and saves to a file.

In [150]:
types = p.species.groupby(p.species).count()
for t in types.index:
    locals()[t.lower()]=p[p['species']==t]
    locals()[t.lower()].drop(['species'], axis=1,inplace=True)
    locals()[t.lower()].to_csv(t.lower()+'.csv', index=False)

/home/rrkelley/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

## T-Test
Let's run a T-Test on the data to see if there is a significant different between mean flipper length for male and female penguins. First, we have two different ways to subset the data.

In [151]:
male = p[p['sex']=='MALE']
female = p.query("sex == 'FEMALE'")

Then we can use ttest_ind from statsmodels.stat to do the T-Test.

In [153]:
stats.ttest_ind(male.flipper_length, female.flipper_length)

Ttest_indResult(statistic=4.9484752715488325, pvalue=1.207911316050343e-06)

The p value is less than .05 significance level so we can conclude that the mean flipper length between males and females in this sample are different.